<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => '名稱',
    'column.guard_name' => 'Guard名稱',
    'column.roles' => '角色',
    'column.permissions' => '權限',
    'column.updated_at' => '更新時間',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => '名稱',
    'field.guard_name' => 'Guard名稱',
    'field.permissions' => '權限',
    'field.select_all.name' => '全選',
    'field.select_all.message' => '啟用此角色目前 <span class="text-primary font-medium">已啟用</span> 的所有權限',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => '設定',
    'nav.role.label' => '角色',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => '角色',
    'resource.label.roles' => '角色',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => '實體',
    'resources' => '資源',
    'widgets' => '小工具',
    'pages' => '頁面',
    'custom' => '自訂權限',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => '您沒有存取權限',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => '檢視',
        'view_any' => '檢視Any',
        'create' => '新增',
        'update' => '更新',
        'delete' => '刪除',
        'delete_any' => '刪除Any',
        'force_delete' => '強制刪除',
        'force_delete_any' => 'Force 刪除Any',
        'restore' => '還原',
        'reorder' => '重新排序',
        'restore_any' => '還原任何',
        'replicate' => '複製',
    ],
];
